{"text":"\n\nFIT5057 Assignment 2: Risk, Quality, and \nStakeholder/Communication Management \nProject Management \nOverview \n \nThis assignment is worth 25% of your final mark. It is divided into two parts: \n● Part 1: Team demonstration of the risk register development process. (During your \nApplied class in Week 8) \n● Part 2: Individual submission of quality and stakeholder/communication management \nplans. (due on Week 9, Friday 9th May 2025 11:55pm) \n \n1. Introduction \nAssignment 2 focuses on three critical aspects of project management: Risk Management, \nQuality Management, and Stakeholder and Communication Management. Through completing \nthis assignment, students will apply their practical and theoretical knowledge to identify, analyse, \nand respond to risks; define measurable quality goals and assurance steps; and build clear and \neffective stakeholder and communication management plans. \n1.1 Assignment Objectives \nThe primary objectives of this assignment are: \n● To enable students to apply risk management frameworks in identifying and mitigating \nproject risks systematically. \n● To develop comprehensive quality management plans that align with project and \norganisational goals. \n● To create effective stakeholder communication strategies, ensuring stakeholder needs \nand expectations are met throughout the project lifecycle.  \n1.2 Relation to Unit Learning Objectives \nThis assignment supports the unit learning objectives by: \n● Applying core principles of risk management to real-world scenarios, enhancing \ndecision-making and critical thinking skills. \n● Strengthening the ability to design quality assurance and control systems that meet \nindustry standards, such as ISO guidelines. \n● Enhancing communication skills and stakeholder engagement through the development \nof targeted communication plans, consistent with professional project management \npractices. \nFIT5057 Assignment 2 - Semester 1 2025                   1 \n\n2. Part 1: Team Demonstration – Risk Management Plan Development \nProcess (20%) \n2.1 Objective \nDemonstrate the process of developing a comprehensive Risk Management Plan for your \nchosen project, explain how risks were identified, analysed, prioritised and managed \ncollaboratively. This includes highlighting the iterative process and the steps taken to ensure a \nthorough and actionable plan. \n2.2 Instructions \n2.2.1 Preparation \n● Utilise Frameworks: Follow the Risk Management Framework covered in Workshop 6.  \n● Collaboration: Hold brainstorming sessions with your team. Ensure a broad and diverse \nrange of risks were discussed in the sessions. \n● Documentation: Record key insights, decisions, as well as reflections on improving the \noverall process. \n2.2.2 Steps to undertake \n● Risk Identification \n○ Brainstorm risks using techniques such as root cause analysis and scenario \nplanning. \n○ Consider both internal and external factors, including technical, financial, and \nstakeholder risks. \n○ Compile a Risk Register that includes at least 6 risks (for a team of 3 students) or \n8 risks (for a team of 4 students) for the projects or the portfolio, detailing their \nsources, likelihood, and potential impacts. \n○ Note that the Assessment will take into consideration the diversity and variations \nof the risks documented in the Risk Register. \n○ Optional for students pursuing Distinction or High Distinction: Ensure cohesive \nrisk identification in the portfolio and across projects, avoiding overlaps. Students \nmay briefly explain this in the Overview or Wrap-Up of the demonstration, and \nreflect on which level the risks are related to (project vs portfolio).  \n● Risk Analysis \n○ Analyse the risks using qualitative and quantitative methods to assess their \nlikelihood and impact. \n● Risk Prioritisation \n○ Develop and utilise a probability-impact matrix to prioritise risks, focusing on risks \nthat could severely impact project outcomes. \nFIT5057 Assignment 2 - Semester 1 2025                   2 \n\n○ Justify your prioritisation decisions through team consensus. \n● Response Planning \n○ Develop response plans for the risks identified in your Risk Register.  \n○ Ensure response plans are realistic and within scope. \n○ Optional for students pursuing High Distinction: Prepare a time and cost analysis \nreport for management, elaborating the implications and time/cost requirements \nto execute the risk responses plans.  \n2.2.3 Demonstration (total of 11 minutes for a team of 4; for a team of up to 3, time should be \nadjusted to maximum 8 minutes): \n● Overview of the Portfolio (1 minute): Introduce your portfolio and each of your \nproject's objectives. \n● Walkthrough the Risk Register (2 minutes per team member): Each team member \npresents two risks related to their project or the portfolio. The presentation comprises  \n○ an overview of each risk,  \n○ the evaluation/analysis of each risk, including likelihood and impact with clear \njustification, and  \n○ a summary of the response strategy.  \n○ Students can illustrate their risks analysis by including screenshots of the Risk \nRegister in their slides or displaying the risk register within the provided Risk \nRegister template.  \n○ Optional for High Distinction: Students who are aiming for High Distinction may \nalso depict the cost and time requirements needed to execute the risk responses  \n● Risk Prioritisation and Wrap Up (2 minute): Describe how risks are prioritised in the \nportfolio, supported by the probability-impact matrix visualisation and key takeaways \nfrom the collaborations with your team on risk management. \n2.2.4 Visual tools and submission: \n● Slides or Visual Tools: Use graphs, tables, and a clear Risk Register and \nprobability-impact matrix for visual support. \n● Submit the following individually before your Week 8 demonstrations: \n○ Complete Team Risk Register (Excel or Word). \n○ Team presentation slides (PDF). \n3. Part 2: Individual Submission - Quality and Stakeholder/Communication \nPlans (80%) \nDue Date: Week 9 (Friday 9th May 2025 11:55pm) \nFIT5057 Assignment 2 - Semester 1 2025                   3 \n\n3.1 Objective \nDevelop individual Quality Management and Stakeholder/Communication Management plans \nfor your individual projects. Demonstrate your ability to maintain project quality expectations and \nstandards and engage and communicate effectively with stakeholders. \n3.2 Quality Management Plan (30%) \n3.2.1 Objective \nDevelop a Quality Management Plan to ensure the project meets the desired stakeholder \nexpectations and standards and aligns with the organisation's goals. \n3.2.2 Instructions \nA. Define Two Quality Objectives and Quality Standards: \na. Clearly articulate two quality objectives of the project, ensuring they align with the \noverall project goals and stakeholder expectations. Define what “quality” means \nfor your individual project.  \nb. For each quality objective, identify at least two applicable standards relevant to \nyour system (e.g. ISO 9001, WCAG, or discipline-specific guidelines). These \nstandards or requirements must provide a basis for ensuring the project meets \nindustry standards and regulatory requirements. \nc. For each quality objective, specify measurable criteria for assessing quality (e.g. \ndefect rates, adherence to specifications, customer satisfaction scores). Ensure \nthese metrics are linked to the identified quality standards and project objectives. \n3.3 Stakeholder/Communication Management Plan (40%): \n3.3.1 Objective \nDevelop a Stakeholder Register and Communication Matrix to support effective stakeholder \nengagement by defining communication expectations, preferred channels, and ensuring \nconsistent communication throughout the project lifecycle. \n3.3.2 Instructions \nA. Stakeholder Register \na. Identify at least eight key stakeholders for the project, including stakeholders \nfrom the project team, the client organisation, and other external parties. \nB. Communication Matrix: \na. Determine the communication needs for the project. Examples include meetings, \nemails, reports, dashboards, etc. \nFIT5057 Assignment 2 - Semester 1 2025                   4 \n\nb. While there is no minimum/maximum number of communication types/methods, \nmake sure that you have identified at least one communication type/method for \neach stakeholder group.  \nc. A stakeholder group or individual stakeholders may be recipients of more than \none communication type/method.  \nC. Stakeholder Management and Engagement Plan: \na. Develop a management and engagement plan for two key stakeholders who are \nnot on the project team. The plan should address how their goals and \nexpectations will be managed throughout the project lifecycle. Indicate their level \nof influence, interest and their current engagement level. \nb. Ensure you identify key stakeholders who have significant influence or a critical \ninterest in the project but are not part of the project team. \n3.3.3 Submission Requirements \n● Format: PDF document \n● Length:  \n○ Section 3.2 (Quality Management Plan): Max 1,000 words — write in paragraph \nformat only. Do not use tables in this section. \n○ Section 3.3.2c (Stakeholder Management and Engagement Plan): Max 500 \nwords (No word limits for Stakeholder Register and Communication Matrix). \n● File Naming Convention: YourStudentID_Assignment2_Part2.pdf \n● Submission: Upload to Moodle by Week 9, Friday 9th May 2025 11.55pm \n4. Completeness and correctness of statements; clarity of expressions (5%) \nThe individual report should contain clearly structured information that is focused on identifying \nand addressing all requirements of the deliverable with clear supporting information. The report \nshould be well presented and include key elements of a succinct report such as a title or cover \npage, a table of contents, page numbers, appendices (if applicable), etc.  \nAll sections of the report and the analyses and discussions are expected to demonstrate \noriginality, creativity, and sophisticated thinking. The statements show an excellent \nunderstanding of the foundation of the unit and a strong capability to transform the theories into \nintellectual contributions. \n5. Use of references (5%) \nStudents are expected to search for relevant extra readings and draw on suitable literature from \nacademic publications as well as practitioner outlets. All sources of information must be fully and \nappropriately acknowledged using in-text citation and reference list. Use at least 3 references. \nThe reference section should use the American Psychological Association (APA) style of \nreferencing.   \nFIT5057 Assignment 2 - Semester 1 2025                   5 \n\n(APA 7th style: https://guides.lib.monash.edu/apa-7 ) \nAssignment deliverables structure & criteria: \nAssignment 2 Deliverable Task & Submission Details Weight \nPart 1 Team Demonstration                              Due Date: During your Applied class in Week 8 (28th April - 2nd May) \n \nDocuments should be individually Submitted before your Week 8 demonstrations: \n● Complete Team Risk Register (Excel or Word). \n● Team presentation slides (PDF). \nProject Risk Management Complete Risk Register and prepare team presentation slides. \nPerform team demonstration of the risk register development \nprocess.  \n20% \nPart 2 Individual Submission                                                               Due Date: Week 9 (Friday 9th May 2025 11:55pm) \n \nFile Naming Convention: YourStudentID_Assignment2_Part2.pdf \nSubmission: Upload to Moodle by Week 9, Friday 9th May 2025 11.55pm \nProject Quality Management  \n \nA list of two quality standards/requirements that meet the \nstakeholder expectations and portfolio requirements. \n \nWord limit: Max 1,000 words — write in paragraph format only. Do \nnot use tables in this section. \n \n \n30% \nProject Stakeholder and \nCommunication Management \nPrepare a stakeholder register including at least 8 major \nstakeholders using the template in the Writing Guide \n \nNo word limit \n \n \n \n \n40% \nPrepare a communication matrix to determine the communication \nneeds for the project stakeholders using the template in the Writing \nGuide \n \nNo word limit \nCreate a stakeholder management and engagement strategy for the \nproject focusing on two stakeholders from the Stakeholder Register \nwho are not on the project team using the template in the Writing \nGuide \n \nWord limit: Max 500 words  \nCompleteness and correctness of statements; clarity of expressions 5% \nUse of references 5% \n \nFIT5057 Assignment 2 - Semester 1 2025                   6 \n\nPlagiarism Declaration\n \nWhen uploading your assignment on Moodle, you are required to accept the Student \nStatement (which includes a declaration that you have not plagiarised during the preparation \nof your assignment solution). You are required to ACCEPT the Student Statement; otherwise, \nyou will not be able to submit your assignment electronically and your assignment will NOT be \nassessed.  \nGenerative AI \nAI & Generative AI tools may be used SELECTIVELY within this assessment. Where used, AI \nmust be used responsibly, clearly documented and appropriately acknowledged (see Learn \nHQ). \n Any work submitted for a mark must: \n● represent a sincere demonstration of your human efforts, skills and subject knowledge \nthat you will be accountable for. \n● adhere to the guidelines for AI use set for the assessment task. \n● reflect the University’s commitment to academic integrity and ethical behaviour. \nInappropriate AI use and/or AI use without acknowledgement will be considered a breach of \nacademic integrity. \nLate Submission \n1. Submission must be made by the due date. Unless an extension or special consideration \nhas been granted, or otherwise specified in the learning management system, students \nwho submit an assessment task after the due date will receive a late-submission penalty \nof 5 percent of the available marks in that task. A further penalty of 5 percent of the \navailable marks will be applied for each additional day (24-hour period), or part thereof, \nthe assessment task is overdue. \n2. If you cannot complete an assessment (due to exceptional circumstances beyond your \ncontrol), you may be eligible for a short extension or special consideration. A short \nextension is two calendar days and is available once for each eligible assessment. The \nfirst short extension for a unit will be granted without a reason given. All subsequent \nextensions require a reason when the application is submitted. Special consideration is a \nlonger extension (for more than two days). Eligible students must supply a reason and \nsupporting documentation. \n3. For more details of the Special Consideration procedure and rules, and how to apply, \nvisit: \nhttps://www.monash.edu/students/admin/exams/changes/special-consideration  \n6. Resources \nRisk Management \nKey Resources: \n● PMI: \n○ PMI Practice Standard for Risk Management: Comprehensive guidelines on \nidentifying, analysing, and responding to risks. \nFIT5057 Assignment 2 - Semester 1 2025                   7 \n\n○ PMI Risk Management Framework: Practical applications of risk assessment and \nmitigation strategies. \n● PMBOK 6th Edition: \n○ Chapter 11: Project Risk Management \n■ Details processes like risk identification, qualitative/quantitative risk \nanalysis, and response planning. \n● PMBOK 7th Edition: \n○ Section: Uncertainty Performance Domain (pp. 66-71) \n■ Focuses on managing risks in dynamic and adaptive environments. \n● Schwalbe (2018): \n○ Chapter 11: Risk Management \n■ Real-world examples and techniques for identifying and mitigating IT \nproject risks. \n● Brewer & Dittman (2018): \n○ Chapter 9: IT-Specific Risks and Solutions \n■ Tools and methods tailored to technology-focused projects. \nQuality Management \nKey Resources: \n● PMI: \n○ PMI Standards for Quality Management: Includes assurance and control \npractices for ensuring deliverable quality. \n● ISO Standards: \n○ ISO 9001: Framework for establishing quality management systems and metrics. \n○ ISO/IEC 25010: Standards for evaluating software product quality, if applicable. \n● PMBOK 6th Edition: \n○ Chapter 8: Project Quality Management \n■ Explains quality planning, assurance, and control processes with \nexamples. \n● PMBOK 7th Edition: \n○ Section: Quality Performance Domain (pp. 75-79) \n■ Emphasis on continuous improvement and adaptive approaches. \n● Schwalbe (2018): \n○ Chapter 8: Quality Management \n■ Hands-on exercises for defining quality metrics and implementing \nassurance processes. \n● Brewer & Dittman (2018): \n○ Chapter 7: Quality Planning and Control \n■ Practical tools for setting standards and performing quality audits. \nStakeholder/Communication Management \nKey Resources: \nFIT5057 Assignment 2 - Semester 1 2025                   8 \n\n● PMI: \n○ PMI Practice Guide on Stakeholder Engagement: Strategies for effective \ncommunication and managing stakeholder expectations. \n● PMBOK 6th Edition: \n○ Chapter 13: Project Stakeholder Management \n■ Covers identification, analysis, and engagement strategies. \n○ Chapter 10: Project Communication Management \n■ Discusses methods and technologies for efficient project communication. \n● PMBOK 7th Edition: \n○ Section: Stakeholder Performance Domain (pp. 80-85) \n■ Focus on aligning stakeholder interests with project goals. \n● Schwalbe (2018): \n○ Chapter 10: Communications Management \n■ Real-world examples for developing communication schedules and \nengagement plans. \n● Brewer & Dittman (2018): \n○ Chapter 5: Stakeholder Analysis and Engagement Strategies \n■ Step-by-step instructions for creating stakeholder matrices and managing \ninfluence. \nGeneral References \n● United Nations SDG Knowledge Platform: \n○ Guidance for aligning project objectives with relevant SDGs, including examples \nand case studies. \n● Monash University Resources: \n○ Monash Climate Action Plan \n○ Monash Energy Institute \n○ Access to Monash University Library databases for peer-reviewed journals and \nindustry standards. \nFIT5057 Assignment 2 - Semester 1 2025                   9 ","images":[],"imageDescriptions":["This document may contain images or figures that couldn't be extracted automatically."]}