{"text":"Document Title: FIT5057_S12025_Assignment 1 Marking Rubric.docx\n\nTask\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nDeliverable 1: Business\nJustification and\nProject\nCharter (< 2,000 words) Deliverable 1 Business\nJustification for the project for which you are the project manager. A highly relevant strategic business justification, including a comprehensive background, an overview of the problem and the opportunity the project proposes for the value delivery system. Demonstrates exceptional use of data-driven analysis, with well-referenced evidence, to evaluate expected costs versus anticipated benefits, ensuring clarity and depth. The strategic alignment of the project with the organisation's mission, vision, and strategic plan is thoroughly analysed. The business justification is well-presented. An adequately articulated business justification, including a background of the problem and the opportunity the project proposes for the value delivery system. Uses referenced data-driven analysis to assess expected costs versus anticipated benefits, with good clarity and supporting evidence. The strategic alignment of the project with the organisation's mission, vision, and strategic plan is clearly discussed. The business justification is reasonably well-presented. A reasonable business justification that includes information about problems and the opportunity the project proposes for the value delivery system. The strategic alignment of the project with the organisation's mission, vision, and strategic plan is explained. The business justification is reasonably presented. A basic business justification that includes information related to the value delivery system. The strategic alignment of the project with the organisation's mission, vision, and strategic plan is briefly mentioned. The business justification is not reasonably presented. There is no or minimal attempt towards business justification or showing the relevance of the project to the value delivery system. No submission or minimal work done. Deliverable 1 A project charter for the project for which you are the project manager. A comprehensive project charter that clearly presents all the key points listed in the assignment description and the template. The project charter is well-presented. A complete project charter adequately presenting all the key points listed in the assignment description and the template with reasonable clarity. The project charter is reasonably well-presented. A project charter presenting most of the key points listed in the assignment description and the template with some clarity. The project charter is reasonably presented. A project charter presenting some of the key points listed in the assignment description and the template with limited clarity. The project charter is not reasonably presented. A project charter presenting limited or no key points listed in the assignment description and the template and lacking clarity. The project charter is not reasonably presented. No submission or minimal work done. FIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 1 Task\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nDeliverable 1: Completeness and correctness of statements; clarity of expressions, The report contains clearly structured information that is focused on developing project charter and justification with clear supporting information. The analysis demonstrates originality, creativity, and sophisticated thinking. The statements show an excellent understanding of the foundation of this unit and a strong capability to transform the theories into intellectual contributions. The report contains mostly structured information that focuses on developing project charter and justification with supporting information. The analysis shows originality and creative thinking. The statements show a sound understanding of the foundation of this unit and a reasonable capability to transform the theories into intellectual contributions. The report contains some structured information to develop project charter and justification with some supporting information. The analysis raises some points, and the statements show a basic understanding of the foundation of this unit and the potential to transform the theories into real contributions. The report presents some project charter and justification with limited analysis and supporting information. The statements show a marginal/limited understanding of the foundation of this unit. The report presents basic project charter and justification with limited or no analysis. The statements imply a lack of understanding of the foundation of this unit. Mostly incomplete and unclear. Deliverable 1: Use of suitable references and application of the\nAPA style of referencing\nUsed a minimum of 3 references, 2 of which from peer reviewed academic journals or conference publications. The references are relevant to the project idea and client organisations’ industry and are published within the past 10 years. The referencing style clearly follows the\nAmerican\nPsychological\nAssociation (APA) style of referencing. Used a minimum of 3 references, 2 of which from peer reviewed academic journals or conference publications. The references are relevant and are published in the past 10 years. The referencing style clearly follows the\nAmerican\nPsychological\nAssociation (APA) style of referencing. Used a minimum of 3 references, 1 of which from academic journals or conference publications. The references are relevant. The referencing style follows the\nAmerican\nPsychological\nAssociation (APA) style of referencing\nUsed a minimum of 3 references, 1 of which from academic journals or conference publications. The referencing style follows the\nAmerican\nPsychological\nAssociation (APA) style of referencing with minor discrepancies\nUsed limited references, some of which from academic journals or conference publications. The referencing style does not follow the\nAPA style of referencing or is missing some essential elements. No citations or minimal work done\nFIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 2 Deliverable 2: Team\nDemonstration - Team\nCharter, Work\nBreakdown\nStructure (WBS), and\nGantt\nChart\nTask\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nTeam\nCharter\nA comprehensive and complete team charter that clearly presents all the key points listed in the assignment description and key elements of the team charter template. The submitted team charter is well-presented. A complete team charter that adequately presents all the key points listed in the assignment description and key elements of the team charter template with reasonable clarity. The submitted team charter is reasonably well-presented. A team charter that presents most of the key points listed in the assignment description and elements of the team charter template with some clarity. The submitted team charter is reasonably presented. A team charter that presents some of the key points listed in the assignment description and elements of the team charter template with limited clarity. The submitted team charter is not reasonably presented. A team charter that presents none or very limited key points listed in the assignment description and elements of the team charter template have limited clarity. The submitted team charter is not reasonably presented. No submission or not addressing the criteria\nFIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 3 Task\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nWork\nBreakdown\nStructure (WBS) Develop a work breakdown structure (WBS) up to\nLevel 3 or\nLevel 4 (as appropriate) Team task - Demonstration of the\nWBS to the team members for constructive feedback and improvement\nA comprehensive\nWBS (to\nLevel 3 or\nLevel 4, as appropriate) which is consistent with the project charter and project scope. Team collaboration and incorporation of peer feedback have been conducted in a timely manner, creating a high quality\nWBS. The output of this task is used to create a\nGantt chart\nA complete and reasonable\nWBS (to\nLevel 3 or\nLevel 4, as appropriate) which is consistent with the project charter and project scope. Team collaboration and incorporation of peer feedback have been conducted in a timely manner, resulting in a reasonable\nWBS (not assessed). The output of this task is used to create a\nGantt chart\nAn acceptable\nWBS that could be missing some elements and/or show a few inconsistencies with the project charter and project scope. Team collaboration and incorporation of peer feedback have been conducted in a timely manner, resulting in an acceptable\nWBS. The output of this task is used to create a\nGantt chart\nA WBS that is missing several major components and is somewhat inconsistent with the project charter and scope. Team collaboration and incorporation of peer feedback was limited, did not occur or was unreliable. The output of this task is used to create a\nGantt chart\nA limited\nWBS that is missing several major components and is inconsistent with the project charter and scope. Limited or no evidence of teamwork and peer collaboration. No evidence and/or minimal work done. No team collaboration and incorporation of peer feedback\nFIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 4 Task\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nGantt\nChart\nA Gantt chart produced by\nProjectLibre, MS Project or other suitable software that accurately depicts the task dependencies, correct task durations and milestones. Team task - Demonstration of the\nWBS to the team members for constructive feedback and improvement (not assessed) The\nGantt chart is clear and accurately depicts the tasks, dependencies, appropriate task durations and milestones. The milestones, task durations and dependencies are logically meaningful and feasible, and clearly demonstrate the rational and justification it follows. The total duration of the project is accurately calculated through correct dependencies among tasks and is consistent with the project charter. A clear and concise summary of the rationale for the task duration estimates, dependencies, milestones, and any other assumptions made is prepared to be discussed with team members. Presentation to the team has been conducted in a timely manner (not assessed). The\nGantt chart is clear and accurately depicts most of the tasks, dependencies, task durations and milestones. The milestones, task durations and dependencies are meaningful and feasible, and somewhat demonstrate the rational and justification it follows. The total duration of the project is calculated through correct dependencies and is consistent with the project charter. A clear summary of the rationale for the task duration estimates, dependencies, milestones, and any other assumptions made is prepared to be discussed with team members. Presentation to the team has been conducted in a timely manner (not assessed). The\nGantt chart shows the tasks, dependencies, task durations and milestones although some elements are missing or misrepresented. The milestones, task durations and dependencies are mostly consistent with the rational and justification it follows. The total duration of the project is consistent with the project charter. A summary of the rationale for the task duration estimates, dependencies, milestones, and any other assumptions made is prepared to be discussed with team members. Presentation to the team has been conducted in a timely manner (not assessed). The\nGantt chart shows most of the tasks, dependencies, task durations and milestones but some elements are missing or misrepresented. The\nGantt chart and its elements, although incomplete, demonstrate some efforts to make them consistent with other deliverables and the project charter. Demonstration was not observed or experienced limited collaboration and teamwork (not assessed). The\nGantt chart shows some tasks, dependencies, task durations and milestones but several elements are missing or misrepresented. The\nGantt chart does not show sufficient consistency with other deliverables and the project charter. No demonstration observed or not meeting minimum requirements of the demonstration (not assessed). Not submitted and/or minimal work done. No demonstration observed or not meeting minimum requirements of the demonstration (not assessed). FIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 5 Task\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nTeam task - Demonstration of\nDeliverable 2: the\nGantt chart and team reflection for assessment during\nApplied\nClass to your tutor\nIn-class demonstration has been conducted in a timely manner while all team members are present and contributing to the demonstration. The demonstration includes a high-level presentation of the\nGantt charts, a meaningful reflection of the approach the team has taken throughout the process of collaboration and teamwork, explaining how the project plans evolved through collaboration and feedback, the extent of change that was required, and what the team learned through the process and connecting theory and practice. The demonstration was accompanied by relevant comprehensive notes and visual aids. In-class demonstration has been conducted in a timely manner while all team members are present and contributing to the demonstration. The demonstration includes a high-level presentation of the\nGantt charts, a reflection of the approach the team has taken throughout the process of collaboration and teamwork, explaining how the project plans evolved through collaboration and feedback, and what the team learned through the process and connecting theory and practice. The demonstration was accompanied by relevant notes and visual aids. In-class demonstration has been conducted in a timely manner while all team members are present and contributing to the demonstration. The demonstration includes a high-level presentation of the\nGantt charts, a reflection of the approach the team has taken throughout the process of collaboration and teamwork, elaborating what the team learned through the process. The demonstration was accompanied by notes and visual aids. In-class demonstration has been conducted with some time management issues while all team members are present and contributing to the demonstration. The presentation of the\nGantt chart and the reflective review has limitations and demonstrates limited effective collaboration and teamwork. The demonstration was accompanied by notes and visual aids. Demonstration was not observed or did not meet minimum requirements of the demonstration. Team members are absent or not contributing to the demonstration. The reflective review has limitations and does not demonstrate effective collaboration and teamwork. Limited\nGantt charts presented or the examples shared in demonstration have significant limitations. No demonstration observed and/or no evidence of collaboration and teamwork. FIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 6 Deliverable 3: Individual\nSubmission - Scope\nDocument and\nCost\nPlanning\nTask\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nDeliverable 3.1 A project scope management plan for the project for which you are responsible (< 1,000 words for\nDeliverable 3.1 Scope\nManagement. No word limit for\nDeliverable 3.2 Cost\nManagement) A well-defined project scope management plan that effectively determines and communicates the detailed description of project scope, deliverables, and work required and reflects on what is considered in-scope and out-of-scope for the project. The project scope and requirements are clearly aligned with the business strategies of the client organisation. The list of deliverables is comprehensive, and includes the expected completion dates. The statement identifies and analyses the relevant constraints of the project, any assumptions made in developing the scope, and the acceptance criteria for the project deliverables are specific with referenced benchmarks. An adequately defined project scope management plan that clearly determines and communicates the descriptions of project scope, deliverables, and work required and reflects on what is considered in-scope and out-of-scope for the project. The alignment of the project scope and requirements are clearly discussed in line with the business strategies of the client organisation. The list of deliverables is clear and inclusive, and includes the expected completion dates. The statement identifies the relevant constraints of the project, any assumptions made in developing the scope, and the acceptance criteria for the project deliverables are specific with referenced benchmarks. A reasonably defined project scope management plan that identifies and communicates the project scope, deliverables, and work required and reflects on what is considered in-scope and out-of-scope for the project. The project scope and requirements are aligned with the business strategies of the client organisation. The list of deliverables is clear and shows the expected completion dates. The statement identifies some of the constraints of the project, assumptions made, and the acceptance criteria for the project deliverables are specific. A project scope management plan that addresses some aspects of the project scope, deliverables, and required work. There are signs that the project scope is aligned with the business strategies of the client organisation. The list of deliverables is included as well as some of the constraints of the project, assumptions made, and some of the acceptance criteria for the project deliverables. A project scope management plan that has limitations in addressing various aspects of the project scope, deliverables, and required work. Some of the deliverables are included as well as some of the constraints of the project, assumptions made, and some of the acceptance criteria for the project deliverables. The information may be vague or lack clarity. No submission and/or minimal work done. FIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 7 Deliverable 3: Individual\nSubmission - Scope\nDocument and\nCost\nPlanning\nTask\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nDeliverable 3.2 A good and reasonable cost model for the project. A well structured cost model that demonstrates thorough consideration and justification in addressing all components of the cost model. Visual presentation of the cost model is comprehensive and accurate. A skilfully developed summary of the main assumptions and estimation approach that underpin the cost model and a brief justification for each assumption. The summary includes concise and brief justifications supported by appropriate references and depicts portfolio alignment with the provided total budget. The cost baseline is fully aligned with the cost model, incorporates realistic and well-justified assumptions, and demonstrates exceptional budget tracking approach. A sufficiently developed cost model that demonstrates adequate consideration and justification in addressing all components of the cost model. Visual presentation of the cost model is adequate. An adequately developed summary of the main assumptions and estimation approach that demonstrates relevance and includes brief justifications supported by appropriate references and depicts portfolio alignment with the provided total budget. The cost baseline is mostly aligned with the cost model, demonstrates realistic assumptions, and shows clear consideration of budget tracking\nA cost model that shows some consideration and justification in addressing essential components. Visual presentation of the cost model is somewhat sufficient. A somewhat developed summary and estimation approach that shows some assumptions with some justification and references and depicts portfolio alignment with the provided total budget. A cost model that shows limited consideration and justification in addressing essential components. Visual presentation of the cost model is acceptable. A summary that shows limited or irrelevant assumptions with limited or no justification or considerations. A cost model that has several limitations shows minimal consideration and justification in addressing components. A limited summary with unclear and inappropriate assumptions with limited or no justification or considerations. Not attempted and/or minimal work done\nFIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 8 Task\nExcellent\nGood\nModerate\nPass\nNear\nPass\nUnrated\nDeliverable 3: Completeness and correctness of statements; clarity of expressions, The report contains clearly structured information that is focused on developing project plans with clear supporting information. The analysis demonstrates originality, creativity, and sophisticated thinking. The statements show an excellent understanding of the foundation of this unit and a strong capability to transform the theories into intellectual contributions. The report contains mostly structured information that focuses on developing project plans with supporting information. The analysis shows originality and creative thinking. The statements show a sound understanding of the foundation of this unit and a reasonable capability to transform the theories into intellectual contributions. The report contains some structured information to develop project plans with some supporting information. The analysis raises some points, and the statements show a basic understanding of the foundation of this unit and the potential to transform the theories into real contributions. The report presents some project plans with limited analysis and supporting information. The statements show a marginal/limited understanding of the foundation of this unit. The report presents basic project plans with limited or no analysis. The statements imply a lack of understanding of the foundation of this unit. Mostly incomplete and unclear. Deliverable 3: Use of suitable references and application of the\nAPA style of referencing\nUsed a minimum of 8 references, 2 of which from peer reviewed academic journals or conference publications. The references are relevant to the project idea and client organisations’ industry and are published within the past 10 years. The referencing style clearly follows the\nAmerican\nPsychological\nAssociation (APA) style of referencing. Used a minimum of 8 references, 2 of which from peer reviewed academic journals or conference publications. The references are relevant and are published in the past 10 years. The referencing style clearly follows the\nAmerican\nPsychological\nAssociation (APA) style of referencing. Used a minimum of 8 references, 1 of which from academic journals or conference publications. The references are relevant. The referencing style follows the\nAmerican\nPsychological\nAssociation (APA) style of referencing\nUsed a minimum of 8 references, 1 of which from academic journals or conference publications. The referencing style follows the\nAmerican\nPsychological\nAssociation (APA) style of referencing with minor discrepancies\nUsed limited references, some of which from academic journals or conference publications. The referencing style does not follow the\nAPA style of referencing or is missing some essential elements. No citations or minimal work done\nNote: The differences between being “skilful” and “sufficient” (or “adequate”): ● Skillful: demonstrate expertise in the ability, knowledge, or skills to perform a task ● Sufficient/adequate: demonstrate required and necessary ability, knowledge, or skill to perform a task\nFIT5057 Project\nManagement - S1 2025 Assignment 1 Assessment\nCriteria 9","images":[],"imageDescriptions":["This document may contain figures, tables, or graphics that weren't extracted as text."]}