{"text":"Document Title: PM S1 2025 Assignment 2: Risk, Quality, and Stakeholder/Communication Management\n\nFIT5057 Assignment 2: Risk, Quality, and\nStakeholder/Communication\nManagement\nProject\nManagement\nOverview\nThis assignment is worth 25% of your final mark. It is divided into two parts: ● Part 1: Team demonstration of the risk register development process. (During your\nApplied class in\nWeek 8) ● Part 2: Individual submission of quality and stakeholder/communication management plans. (due on\nWeek 9, Friday 9th\nMay 2025 11:55pm) 1. Introduction\nAssignment 2 focuses on three critical aspects of project management: Risk\nManagement, Quality\nManagement, and\nStakeholder and\nCommunication\nManagement. Through completing this assignment, students will apply their practical and theoretical knowledge to identify, analyse, and respond to risks; define measurable quality goals and assurance steps; and build clear and effective stakeholder and communication management plans. 1.1 Assignment\nObjectives\nThe primary objectives of this assignment are: ● To enable students to apply risk management frameworks in identifying and mitigating project risks systematically. ● To develop comprehensive quality management plans that align with project and organisational goals. ● To create effective stakeholder communication strategies, ensuring stakeholder needs and expectations are met throughout the project lifecycle. 1.2 Relation to\nUnit\nLearning\nObjectives\nThis assignment supports the unit learning objectives by: ● Applying core principles of risk management to real-world scenarios, enhancing decision-making and critical thinking skills. ● Strengthening the ability to design quality assurance and control systems that meet industry standards, such as\nISO guidelines. ● Enhancing communication skills and stakeholder engagement through the development of targeted communication plans, consistent with professional project management practices. FIT5057 Assignment 2 - Semester 1 2025 1 2. Part 1: Team\nDemonstration – Risk\nManagement\nPlan\nDevelopment\nProcess (20%) 2.1 Objective\nDemonstrate the process of developing a comprehensive\nRisk\nManagement\nPlan for your chosen project, explain how risks were identified, analysed, prioritised and managed collaboratively. This includes highlighting the iterative process and the steps taken to ensure a thorough and actionable plan. 2.2 Instructions 2.2.1 Preparation ● Utilise\nFrameworks: Follow the\nRisk\nManagement\nFramework covered in\nWorkshop 6. ● Collaboration: Hold brainstorming sessions with your team. Ensure a broad and diverse range of risks were discussed in the sessions. ● Documentation: Record key insights, decisions, as well as reflections on improving the overall process. 2.2.2 Steps to undertake ● Risk\nIdentification ○ Brainstorm risks using techniques such as root cause analysis and scenario planning. ○ Consider both internal and external factors, including technical, financial, and stakeholder risks. ○ Compile a\nRisk\nRegister that includes at least 6 risks (for a team of 3 students) or 8 risks (for a team of 4 students) for the projects or the portfolio, detailing their sources, likelihood, and potential impacts. ○ Note that the\nAssessment will take into consideration the diversity and variations of the risks documented in the\nRisk\nRegister. ○ Optional for students pursuing\nDistinction or\nHigh\nDistinction: Ensure cohesive risk identification in the portfolio and across projects, avoiding overlaps. Students may briefly explain this in the\nOverview or\nWrap-Up of the demonstration, and reflect on which level the risks are related to (project vs portfolio). ● Risk\nAnalysis ○ Analyse the risks using qualitative and quantitative methods to assess their likelihood and impact. ● Risk\nPrioritisation ○ Develop and utilise a probability-impact matrix to prioritise risks, focusing on risks that could severely impact project outcomes. FIT5057 Assignment 2 - Semester 1 2025 2 ○ Justify your prioritisation decisions through team consensus. ● Response\nPlanning ○ Develop response plans for the risks identified in your\nRisk\nRegister. ○ Ensure response plans are realistic and within scope. ○ Optional for students pursuing\nHigh\nDistinction: Prepare a time and cost analysis report for management, elaborating the implications and time/cost requirements to execute the risk responses plans. 2.2.3 Demonstration (total of 11 minutes for a team of 4; for a team of up to 3, time should be adjusted to maximum 8 minutes): ● Overview of the\nPortfolio (1 minute): Introduce your portfolio and each of your project's objectives. ● Walkthrough the\nRisk\nRegister (2 minutes per team member): Each team member presents two risks related to their project or the portfolio. The presentation comprises ○ an overview of each risk, ○ the evaluation/analysis of each risk, including likelihood and impact with clear justification, and ○ a summary of the response strategy. ○ Students can illustrate their risks analysis by including screenshots of the\nRisk\nRegister in their slides or displaying the risk register within the provided\nRisk\nRegister template. ○ Optional for\nHigh\nDistinction: Students who are aiming for\nHigh\nDistinction may also depict the cost and time requirements needed to execute the risk responses ● Risk\nPrioritisation and\nWrap\nUp (2 minute): Describe how risks are prioritised in the portfolio, supported by the probability-impact matrix visualisation and key takeaways from the collaborations with your team on risk management. 2.2.4 Visual tools and submission: ● Slides or\nVisual\nTools: Use graphs, tables, and a clear\nRisk\nRegister and probability-impact matrix for visual support. ● Submit the following individually before your\nWeek 8 demonstrations: ○ Complete\nTeam\nRisk\nRegister (Excel or\nWord). ○ Team presentation slides (PDF). 3. Part 2: Individual\nSubmission - Quality and\nStakeholder/Communication\nPlans (80%) Due\nDate: Week 9 (Friday 9th\nMay 2025 11:55pm) FIT5057 Assignment 2 - Semester 1 2025 3 3.1 Objective\nDevelop individual\nQuality\nManagement and\nStakeholder/Communication\nManagement plans for your individual projects. Demonstrate your ability to maintain project quality expectations and standards and engage and communicate effectively with stakeholders. 3.2 Quality\nManagement\nPlan (30%) 3.2.1 Objective\nDevelop a\nQuality\nManagement\nPlan to ensure the project meets the desired stakeholder expectations and standards and aligns with the organisation's goals. 3.2.2 Instructions\nA. Define\nTwo\nQuality\nObjectives and\nQuality\nStandards: a. Clearly articulate two quality objectives of the project, ensuring they align with the overall project goals and stakeholder expectations. Define what “quality” means for your individual project. b. For each quality objective, identify at least two applicable standards relevant to your system (e.g. ISO 9001, WCAG, or discipline-specific guidelines). These standards or requirements must provide a basis for ensuring the project meets industry standards and regulatory requirements. c. For each quality objective, specify measurable criteria for assessing quality (e.g. defect rates, adherence to specifications, customer satisfaction scores). Ensure these metrics are linked to the identified quality standards and project objectives. 3.3 Stakeholder/Communication\nManagement\nPlan (40%): 3.3.1 Objective\nDevelop a\nStakeholder\nRegister and\nCommunication\nMatrix to support effective stakeholder engagement by defining communication expectations, preferred channels, and ensuring consistent communication throughout the project lifecycle. 3.3.2 Instructions\nA. Stakeholder\nRegister a. Identify at least eight key stakeholders for the project, including stakeholders from the project team, the client organisation, and other external parties. B. Communication\nMatrix: a. Determine the communication needs for the project. Examples include meetings, emails, reports, dashboards, etc. FIT5057 Assignment 2 - Semester 1 2025 4 b. While there is no minimum/maximum number of communication types/methods, make sure that you have identified at least one communication type/method for each stakeholder group. c. A stakeholder group or individual stakeholders may be recipients of more than one communication type/method. C. Stakeholder\nManagement and\nEngagement\nPlan: a. Develop a management and engagement plan for two key stakeholders who are not on the project team. The plan should address how their goals and expectations will be managed throughout the project lifecycle. Indicate their level of influence, interest and their current engagement level. b. Ensure you identify key stakeholders who have significant influence or a critical interest in the project but are not part of the project team. 3.3.3 Submission\nRequirements ● Format: PDF document ● Length: ○ Section 3.2 (Quality\nManagement\nPlan): Max 1,000 words — write in paragraph format only. Do not use tables in this section. ○ Section 3.3.2c (Stakeholder\nManagement and\nEngagement\nPlan): Max 500 words (No word limits for\nStakeholder\nRegister and\nCommunication\nMatrix). ● File\nNaming\nConvention: YourStudentID_Assignment2_Part2.pdf ● Submission: Upload to\nMoodle by\nWeek 9, Friday 9th\nMay 2025 11.55pm 4. Completeness and correctness of statements; clarity of expressions (5%) The individual report should contain clearly structured information that is focused on identifying and addressing all requirements of the deliverable with clear supporting information. The report should be well presented and include key elements of a succinct report such as a title or cover page, a table of contents, page numbers, appendices (if applicable), etc. All sections of the report and the analyses and discussions are expected to demonstrate originality, creativity, and sophisticated thinking. The statements show an excellent understanding of the foundation of the unit and a strong capability to transform the theories into intellectual contributions. 5. Use of references (5%) Students are expected to search for relevant extra readings and draw on suitable literature from academic publications as well as practitioner outlets. All sources of information must be fully and appropriately acknowledged using in-text citation and reference list. Use at least 3 references. The reference section should use the\nAmerican\nPsychological\nAssociation (APA) style of referencing. FIT5057 Assignment 2 - Semester 1 2025 5 (APA 7th style: https://guides.lib.monash.edu/apa-7 ) Assignment deliverables structure & criteria: Assignment 2 Deliverable\nTask & Submission\nDetails\nWeight\nPart 1 Team\nDemonstration\nDue\nDate: During your\nApplied class in\nWeek 8 (28th\nApril - 2nd\nMay) Documents should be individually\nSubmitted before your\nWeek 8 demonstrations: ● Complete\nTeam\nRisk\nRegister (Excel or\nWord). ● Team presentation slides (PDF). Project\nRisk\nManagement\nComplete\nRisk\nRegister and prepare team presentation slides. Perform team demonstration of the risk register development process. 20% Part 2 Individual\nSubmission\nDue\nDate: Week 9 (Friday 9th\nMay 2025 11:55pm) File\nNaming\nConvention: YourStudentID_Assignment2_Part2.pdf\nSubmission: Upload to\nMoodle by\nWeek 9, Friday 9th\nMay 2025 11.55pm\nProject\nQuality\nManagement\nA list of two quality standards/requirements that meet the stakeholder expectations and portfolio requirements. Word limit: Max 1,000 words — write in paragraph format only. Do not use tables in this section. 30% Project\nStakeholder and\nCommunication\nManagement\nPrepare a stakeholder register including at least 8 major stakeholders using the template in the\nWriting\nGuide\nNo word limit 40% Prepare a communication matrix to determine the communication needs for the project stakeholders using the template in the\nWriting\nGuide\nNo word limit\nCreate a stakeholder management and engagement strategy for the project focusing on two stakeholders from the\nStakeholder\nRegister who are not on the project team using the template in the\nWriting\nGuide\nWord limit: Max 500 words\nCompleteness and correctness of statements; clarity of expressions 5% Use of references 5% FIT5057 Assignment 2 - Semester 1 2025 6 Plagiarism\nDeclaration\nWhen uploading your assignment on\nMoodle, you are required to accept the\nStudent\nStatement (which includes a declaration that you have not plagiarised during the preparation of your assignment solution). You are required to\nACCEPT the\nStudent\nStatement; otherwise, you will not be able to submit your assignment electronically and your assignment will\nNOT be assessed. Generative\nAI AI & Generative\nAI tools may be used\nSELECTIVELY within this assessment. Where used, AI must be used responsibly, clearly documented and appropriately acknowledged (see\nLearn\nHQ). Any work submitted for a mark must: ● represent a sincere demonstration of your human efforts, skills and subject knowledge that you will be accountable for. ● adhere to the guidelines for\nAI use set for the assessment task. ● reflect the\nUniversity’s commitment to academic integrity and ethical behaviour. Inappropriate\nAI use and/or\nAI use without acknowledgement will be considered a breach of academic integrity. Late\nSubmission 1. Submission must be made by the due date. Unless an extension or special consideration has been granted, or otherwise specified in the learning management system, students who submit an assessment task after the due date will receive a late-submission penalty of 5 percent of the available marks in that task. A further penalty of 5 percent of the available marks will be applied for each additional day (24-hour period), or part thereof, the assessment task is overdue. 2. If you cannot complete an assessment (due to exceptional circumstances beyond your control), you may be eligible for a short extension or special consideration. A short extension is two calendar days and is available once for each eligible assessment. The first short extension for a unit will be granted without a reason given. All subsequent extensions require a reason when the application is submitted. Special consideration is a longer extension (for more than two days). Eligible students must supply a reason and supporting documentation. 3. For more details of the\nSpecial\nConsideration procedure and rules, and how to apply, visit: https://www.monash.edu/students/admin/exams/changes/special-consideration 6. Resources\nRisk\nManagement\nKey\nResources: ● PMI: ○ PMI Practice\nStandard for\nRisk\nManagement: Comprehensive guidelines on identifying, analysing, and responding to risks. FIT5057 Assignment 2 - Semester 1 2025 7 ○ PMI Risk\nManagement\nFramework: Practical applications of risk assessment and mitigation strategies. ● PMBOK 6th\nEdition: ○ Chapter 11: Project\nRisk\nManagement ■ Details processes like risk identification, qualitative/quantitative risk analysis, and response planning. ● PMBOK 7th\nEdition: ○ Section: Uncertainty\nPerformance\nDomain (pp. 66-71) ■ Focuses on managing risks in dynamic and adaptive environments. ● Schwalbe (2018): ○ Chapter 11: Risk\nManagement ■ Real-world examples and techniques for identifying and mitigating\nIT project risks. ● Brewer & Dittman (2018): ○ Chapter 9: IT-Specific\nRisks and\nSolutions ■ Tools and methods tailored to technology-focused projects. Quality\nManagement\nKey\nResources: ● PMI: ○ PMI Standards for\nQuality\nManagement: Includes assurance and control practices for ensuring deliverable quality. ● ISO Standards: ○ ISO 9001: Framework for establishing quality management systems and metrics. ○ ISO/IEC 25010: Standards for evaluating software product quality, if applicable. ● PMBOK 6th\nEdition: ○ Chapter 8: Project\nQuality\nManagement ■ Explains quality planning, assurance, and control processes with examples. ● PMBOK 7th\nEdition: ○ Section: Quality\nPerformance\nDomain (pp. 75-79) ■ Emphasis on continuous improvement and adaptive approaches. ● Schwalbe (2018): ○ Chapter 8: Quality\nManagement ■ Hands-on exercises for defining quality metrics and implementing assurance processes. ● Brewer & Dittman (2018): ○ Chapter 7: Quality\nPlanning and\nControl ■ Practical tools for setting standards and performing quality audits. Stakeholder/Communication\nManagement\nKey\nResources: FIT5057 Assignment 2 - Semester 1 2025 8 ● PMI: ○ PMI Practice\nGuide on\nStakeholder\nEngagement: Strategies for effective communication and managing stakeholder expectations. ● PMBOK 6th\nEdition: ○ Chapter 13: Project\nStakeholder\nManagement ■ Covers identification, analysis, and engagement strategies. ○ Chapter 10: Project\nCommunication\nManagement ■ Discusses methods and technologies for efficient project communication. ● PMBOK 7th\nEdition: ○ Section: Stakeholder\nPerformance\nDomain (pp. 80-85) ■ Focus on aligning stakeholder interests with project goals. ● Schwalbe (2018): ○ Chapter 10: Communications\nManagement ■ Real-world examples for developing communication schedules and engagement plans. ● Brewer & Dittman (2018): ○ Chapter 5: Stakeholder\nAnalysis and\nEngagement\nStrategies ■ Step-by-step instructions for creating stakeholder matrices and managing influence. General\nReferences ● United\nNations\nSDG Knowledge\nPlatform: ○ Guidance for aligning project objectives with relevant\nSDGs, including examples and case studies. ● Monash\nUniversity\nResources: ○ Monash\nClimate\nAction\nPlan ○ Monash\nEnergy\nInstitute ○ Access to\nMonash\nUniversity\nLibrary databases for peer-reviewed journals and industry standards. FIT5057 Assignment 2 - Semester 1 2025 9","images":[],"imageDescriptions":["This document may contain figures, tables, or graphics that weren't extracted as text."]}